# CantKeepJoinTangent Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurveFailures..::..CantKeepJoinTangent Property
BuiltInFailures..::..CurveFailures Class See Also
---
Can't keep curve join tangent.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantKeepJoinTangent { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantKeepJoinTangent As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantKeepJoinTangent {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurveFailures Class
Autodesk.Revit.DB Namespace